{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature-evidence report listing three earthquake-refresh related features and their associated files and metadata.",
  "frontend-file-summaries.txt": "High-level summaries of all frontend files describing styling, utilities, hooks, components, and pages.",
  "frontend/index.css": "Tailwind base setup defining extensive light/dark design tokens using OKLCH values and applying global styles.",
  "frontend/index.html": "HTML entry point loading Leaflet scripts and styles, setting the app root, and linking favicon assets.",
  "frontend/src/App.tsx": "App wrapper applying ThemeProvider and rendering the EarthquakeDashboard.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Dashboard summary cards showing total events, above-threshold counts, and the largest magnitude with styled UI elements.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Detailed earthquake dialog with fetched event details, magnitude badges, metadata fields, and optional moment‑tensor info.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet-based interactive map rendering earthquake markers within bounds, supporting popups, filtering, and fullscreen mode.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "A virtualized table component that lists earthquake events with metadata and supports selection and constrained scrolling.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "UI controls for filtering earthquake data by time window, magnitude, search text, and manual refresh.",
  "frontend/src/components/earthquake/PanelCard.tsx": "A styled card wrapper providing consistent headers, subtitles, and layout for earthquake panels.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that USGS data fetching is handled elsewhere.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "React Query hook that fetches USGS earthquake feed data based on the selected time window with periodic refresh.",
  "frontend/src/hooks/useUsgsEventDetail.ts": "Fetches and caches detailed USGS event data for a specific event URL when enabled.",
  "frontend/src/hooks/useVirtualWindow.ts": "Implements lightweight list virtualization by calculating visible item indices from scroll position and container height.",
  "frontend/src/index.css": "Global Tailwind and theme styles, including color variables, map-related overrides, and fullscreen map behavior.",
  "frontend/src/lib/earthquakeFilters.ts": "Provides filtering and sorting utilities for USGS features by time window, magnitude, and place, plus a combined applyFilters pipeline.",
  "frontend/src/lib/earthquakeMapBounds.ts": "Filters earthquakes to those within (or slightly outside) Leaflet map bounds with date-line wrapping handling.",
  "frontend/src/lib/earthquakeStats.ts": "Computes simple stats including total count, count above a magnitude threshold, and largest-magnitude event.",
  "frontend/src/lib/fetchJson.ts": "Lightweight helper to fetch a URL and return parsed JSON with error handling.",
  "frontend/src/lib/formatters.ts": "Formatting helpers for timestamps, magnitudes, depths, and coordinates into human-readable strings.",
  "frontend/src/lib/leafletTypes.ts": "Provides Leaflet-related TypeScript interfaces plus a helper to create stylized circle markers based on magnitude.",
  "frontend/src/lib/mmi.ts": "Maps numeric MMI values to Roman numerals and labels and formats full MMI display strings.",
  "frontend/src/lib/usgsEventDetailTypes.ts": "TypeScript types for USGS event-detail API responses including moment‑tensor product metadata.",
  "frontend/src/lib/usgsFeeds.ts": "Defines USGS feed URLs by time window and helpers for magnitude labels and colors.",
  "frontend/src/lib/usgsTypes.ts": "Type definitions for USGS GeoJSON earthquake features, responses, and filter settings.",
  "frontend/src/main.tsx": "Initializes the React app with React Query and Internet Identity providers and renders App.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Implements the main earthquake dashboard with filtering, view modes, manual refresh, and detail selection.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration including theme extensions, colors, animations, and plugins.",
  "project_state.json": "Describes project state and fix requirements focused on making the Refresh Data button behave correctly."
}