{
  "backend/main.mo": "Minimal Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report listing two filtering/sorting features, their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including filters, stats, hooks, map view, and UI components.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark OKLCH color variables and applying base background/foreground styles.",
  "frontend/index.html": "HTML entry loading Leaflet assets and mounting the React app with updated title and favicon links.",
  "frontend/src/App.tsx": "Root component wrapping the dashboard in a ThemeProvider with dark mode enabled.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Displays total events, above-threshold count, and largest-magnitude earthquake using stat cards.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Modal dialog showing detailed earthquake info including magnitude, coordinates, depth, time, and MMI scale.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet-based map view that renders only earthquakes within current bounds and updates markers on map movement.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "Displays a virtualized, scrollable table of earthquake events with selectable rows and action controls.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "Provides UI controls for time window, magnitude, search input, and refresh to filter earthquake data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity login, storage, and state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating USGS data fetching occurs elsewhere.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "Fetches USGS earthquake feed data using react-query with periodic refetching.",
  "frontend/src/hooks/useVirtualWindow.ts": "Implements lightweight list virtualization based on scroll position and estimated item height.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, earth-tone variables, and Leaflet z-index fixes.",
  "frontend/src/lib/earthquakeFilters.ts": "Provides filtering and sorting utilities for earthquakes by time window, magnitude, and location query.",
  "frontend/src/lib/earthquakeMapBounds.ts": "Filters earthquakes to those within map bounds, handling padding and date-line wrapping.",
  "frontend/src/lib/earthquakeStats.ts": "Computes simple earthquake statistics including total count, threshold count, and largest magnitude event.",
  "frontend/src/lib/fetchJson.ts": "Provides a generic helper to fetch JSON from a URL and throw on HTTP errors.",
  "frontend/src/lib/formatters.ts": "Contains utility functions for formatting timestamps, magnitudes, depths, and coordinates for display.",
  "frontend/src/lib/leafletTypes.ts": "Defines TypeScript bindings for Leaflet objects and includes helpers for checking Leaflet availability and creating earthquake markers.",
  "frontend/src/lib/mmi.ts": "Implements utilities for converting MMI values into formatted strings, Roman numerals, and descriptive labels.",
  "frontend/src/lib/usgsFeeds.ts": "Builds USGS feed URLs and provides magnitude classification and color helpers.",
  "frontend/src/lib/usgsTypes.ts": "Defines TypeScript interfaces for USGS GeoJSON responses and earthquake filter options.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Implements the main earthquake dashboard with feed selection, filtering, stats, table/map views, and detail dialogs.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, animations, and content paths.",
  "project_state.json": "Describes project metadata, architecture notes, known issues, and implemented feature requirements."
}