{
  "backend/main.mo": "Minimal Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report mapping two UI changes to their affected files and components.",
  "frontend-file-summaries.txt": "Text file containing precomputed summaries for numerous frontend files.",
  "frontend/index.css": "Base Tailwind setup defining CSS variables for light/dark themes and global background/text styles.",
  "frontend/index.html": "Main HTML entry loading Leaflet assets and mounting the React app.",
  "frontend/src/App.tsx": "Wraps the EarthquakeDashboard in a ThemeProvider with dark mode default.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Displays three styled dashboard summary cards for total events, threshold events, and largest magnitude.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Modal dialog showing detailed earthquake info, including magnitude, metadata, and optional moment tensor data.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet-based map that renders markers, filters by bounds, and includes a full-screen toggle control.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "Renders a virtualized earthquake results table with selectable rows and fallback UI when no data is available.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "Provides controls for time window, magnitude filter, search input, and refresh actions for earthquake feeds.",
  "frontend/src/components/earthquake/PanelCard.tsx": "Shared card wrapper component that standardizes panel headers, optional actions, and content layout.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and persisted identities via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that USGS data fetching is handled elsewhere.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "Fetches USGS earthquake feed data using React Query with periodic refetching.",
  "frontend/src/hooks/useUsgsEventDetail.ts": "Fetches and caches USGS event detail JSON for a specific earthquake when enabled.",
  "frontend/src/hooks/useVirtualWindow.ts": "Implements a lightweight virtualization hook computing visible item ranges based on scroll position.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables for light/dark themes, Leaflet layer adjustments, fullscreen map styles, and UI animations.",
  "frontend/src/lib/earthquakeFilters.ts": "Provides filtering and sorting utilities for USGS earthquake features by time window, magnitude, and place.",
  "frontend/src/lib/earthquakeMapBounds.ts": "Filters earthquakes to those within padded Leaflet map bounds, handling date-line wrapping.",
  "frontend/src/lib/earthquakeStats.ts": "Computes basic earthquake statistics including totals, threshold counts, and largest magnitude.",
  "frontend/src/lib/fetchJson.ts": "Fetches JSON from a URL and throws on non-OK HTTP responses.",
  "frontend/src/lib/formatters.ts": "Formats timestamps, magnitudes, depths, and coordinates for UI display.",
  "frontend/src/lib/leafletTypes.ts": "Defines Leaflet type interfaces and utilities including marker creation with magnitude-based styling.",
  "frontend/src/lib/mmi.ts": "Converts MMI values to formatted text, Roman numerals, and descriptive labels.",
  "frontend/src/lib/usgsEventDetailTypes.ts": "Type definitions for USGS event detail responses, including moment tensor product structures.",
  "frontend/src/lib/usgsFeeds.ts": "Generates USGS feed URLs and provides magnitude labels and color categories.",
  "frontend/src/lib/usgsTypes.ts": "Type definitions for USGS GeoJSON features, responses, and filter settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and identity provider wrappers.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Main dashboard page handling filters, view modes, data fetching, and earthquake detail selection.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, animations, and theme extensions.",
  "project_state.json": "Stores project metadata, implemented features, and pending feature requests."
}