{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "JSON report listing detected feature changes, associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend source files and assets.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color tokens, dark mode overrides, and base element styling.",
  "frontend/index.html": "HTML entry point loading Leaflet assets and mounting the app root with the main TSX module.",
  "frontend/src/App.tsx": "Root component applying theme support and rendering the earthquake dashboard.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Displays three summary cards showing total events, above-threshold count, and the largest earthquake.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Dialog rendering detailed earthquake information, including moment tensor data when available.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet-based map that renders and filters earthquake markers by bounds, supporting optional constrained height.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "Displays a virtualized, scrollable table of earthquake results with selection, moment-tensor detection, and action controls.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "Provides UI controls for time window, magnitude, search filtering, and data refresh actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login/logout, and persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that USGS data is fetched client‑side elsewhere.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "Fetches USGS earthquake feed data with React Query and auto‑refreshes at set intervals.",
  "frontend/src/hooks/useUsgsEventDetail.ts": "Fetches and caches detailed USGS event information when a detail URL is provided.",
  "frontend/src/hooks/useVirtualWindow.ts": "Implements lightweight virtualization logic to compute visible list indices based on scroll position.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark seismic-themed color variables, and Leaflet z-index adjustments.",
  "frontend/src/lib/earthquakeFilters.ts": "Provides filtering and sorting utilities for earthquakes based on time window, magnitude, and search text.",
  "frontend/src/lib/earthquakeMapBounds.ts": "Filters earthquakes to those within (or near) given map bounds with date-line handling.",
  "frontend/src/lib/earthquakeStats.ts": "Computes total count, count above a magnitude threshold, and finds the largest-magnitude feature from a list.",
  "frontend/src/lib/fetchJson.ts": "Fetches a URL and returns parsed JSON, throwing an error on non-OK responses.",
  "frontend/src/lib/formatters.ts": "Provides formatting helpers for timestamps, magnitudes, depths, and coordinates.",
  "frontend/src/lib/leafletTypes.ts": "Defines Leaflet-related TypeScript types and utilities, including a marker factory using magnitude-based styling.",
  "frontend/src/lib/mmi.ts": "Implements MMI formatting utilities converting numeric values to Roman numerals and descriptive labels.",
  "frontend/src/lib/usgsEventDetailTypes.ts": "Defines TypeScript types for detailed USGS earthquake event responses, including moment tensor products.",
  "frontend/src/lib/usgsFeeds.ts": "Provides USGS feed URLs and helpers for labeling and coloring magnitudes.",
  "frontend/src/lib/usgsTypes.ts": "Defines core USGS GeoJSON feature and response types plus filter-related interfaces.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Implements the main dashboard with filtering, view modes, stats, and earthquake detail interactions.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, plugins, colors, fonts, and animations.",
  "project_state.json": "Project metadata describing state, issues, and feature requirements for UI border clipping fixes."
}