{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping fullscreen Leaflet fixes to specific frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing multiple frontend source files and their roles.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and theming variables for light and dark modes.",
  "frontend/index.html": "HTML entrypoint loading Leaflet CSS/JS and mounting the React app.",
  "frontend/src/App.tsx": "Wraps the app in a theme provider and renders the EarthquakeDashboard.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Displays earthquake summary statistics using styled cards and icons.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Dialog showing full earthquake details with magnitude badges, metadata, and fetched event detail info.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet-based map with marker rendering, fullscreen handling, and visibility filtering based on bounds.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "Renders a virtualized earthquake results table with selectable rows and adaptive height, displaying magnitude, location, and other metadata.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "Provides UI controls for time window, minimum magnitude, search text, and manual refresh of earthquake data.",
  "frontend/src/components/earthquake/PanelCard.tsx": "Reusable panel wrapper component with styled header, optional actions, and content area for consistent layouts.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating related queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that USGS fetching is handled elsewhere.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "React Query hook that fetches USGS earthquake feeds by time window with auto-refresh and manual refresh support.",
  "frontend/src/hooks/useUsgsEventDetail.ts": "Fetches and caches detailed USGS event data by URL with optional enabling and retry logic.",
  "frontend/src/hooks/useVirtualWindow.ts": "Implements a lightweight virtualization system computing visible item ranges based on scroll position and container size.",
  "frontend/src/index.css": "Defines global Tailwind layers, color variables, theming, custom scrollbars, map-related z-index fixes, and utility styles.",
  "frontend/src/lib/earthquakeFilters.ts": "Provides filtering utilities for earthquakes by time window, magnitude, place, and includes time‑descending sorting.",
  "frontend/src/lib/earthquakeMapBounds.ts": "Filters earthquakes to those within (or slightly outside) given Leaflet map bounds, handling padded bounds and date‑line wrapping.",
  "frontend/src/lib/earthquakeStats.ts": "Computes basic stats from earthquake features, including totals, count above magnitude threshold, and the largest quake.",
  "frontend/src/lib/fetchJson.ts": "Simple wrapper around fetch that retrieves JSON and throws on HTTP errors.",
  "frontend/src/lib/formatters.ts": "Formatting helpers for timestamps, magnitude, depth, and geographic coordinates.",
  "frontend/src/lib/leafletTypes.ts": "Type definitions and utilities for Leaflet, including marker creation with magnitude‑based styling.",
  "frontend/src/lib/mmi.ts": "Utilities to map MMI values to Roman numerals and labels, with formatting helpers.",
  "frontend/src/lib/usgsEventDetailTypes.ts": "Type definitions for USGS event detail responses, including product metadata.",
  "frontend/src/lib/usgsFeeds.ts": "Builds USGS feed URLs and provides magnitude labels and color classifications.",
  "frontend/src/lib/usgsTypes.ts": "Core TypeScript types for USGS earthquake feed features, responses, and filter configs.",
  "frontend/src/main.tsx": "Application entry point initializing React, React Query, and Internet Identity provider.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Main dashboard page handling filters, view modes, data fetching, stats, and earthquake detail selection.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata describing current state, issues, and existing feature requirements related to Leaflet fullscreen bugs."
}