{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature report documenting a UI fix for table height interactions in two frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing styles, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH-themed color variables for light and dark modes with global border and background rules.",
  "frontend/index.html": "HTML entry point loading Leaflet assets and mounting the frontend app.",
  "frontend/src/App.tsx": "Root component providing theme support and rendering the EarthquakeDashboard.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Displays total events, above-threshold count, and largest-magnitude event using cards and badges.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Dialog showing detailed earthquake info with optional moment tensor data fetched on demand.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet-based map that filters and renders markers only within current viewport bounds with debounced updates.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "Renders a virtualized table of earthquake results with selectable rows and moment-tensor indicators.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "Provides UI controls for time window, magnitude, search, and refresh actions for filtering USGS feeds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and persistence through a React context.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file with no functionality.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "Fetches and caches USGS earthquake feed data with auto-refresh using React Query.",
  "frontend/src/hooks/useUsgsEventDetail.ts": "Loads and caches detailed USGS event data by URL with optional enable control.",
  "frontend/src/hooks/useVirtualWindow.ts": "Calculates a virtualized item window based on scroll position to optimize rendering of large lists.",
  "frontend/src/index.css": "Defines Tailwind base styles, theming variables, dark mode, and Leaflet z-index adjustments.",
  "frontend/src/lib/earthquakeFilters.ts": "Implements filtering and sorting of USGS features by time window, magnitude, and location query.",
  "frontend/src/lib/earthquakeMapBounds.ts": "Filters earthquakes to those inside padded map bounds with date-line wrapping support.",
  "frontend/src/lib/earthquakeStats.ts": "Computes basic stats from a list of USGS features, including total count, number above a magnitude threshold, and the largest magnitude event.",
  "frontend/src/lib/fetchJson.ts": "Fetches a URL and returns parsed JSON, throwing an error on non‑OK HTTP responses.",
  "frontend/src/lib/formatters.ts": "Provides helpers to format timestamps, magnitudes, depths, and coordinates into human‑friendly strings.",
  "frontend/src/lib/leafletTypes.ts": "Defines minimal Leaflet TypeScript interfaces and utilities, including marker creation with color and size based on magnitude.",
  "frontend/src/lib/mmi.ts": "Supplies utilities to convert numeric MMI values into Roman numerals and descriptive labels.",
  "frontend/src/lib/usgsEventDetailTypes.ts": "Defines TypeScript types for detailed USGS event data, including moment tensor product structures.",
  "frontend/src/lib/usgsFeeds.ts": "Builds USGS feed URLs, provides time‑window options, and maps magnitudes to labels and colors.",
  "frontend/src/lib/usgsTypes.ts": "Declares core USGS GeoJSON feature and response types plus filter parameter types.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Implements the main dashboard with filtering, stats, table/map views, theming, and earthquake selection.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, animations, and content scanning rules.",
  "project_state.json": "Describes project state, architecture notes, known issues, and existing feature definitions for the earthquake web app."
}