{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing UI layering fixes and Leaflet stacking-context adjustments with related files and metadata.",
  "frontend-file-summaries.txt": "Pre-written summaries describing all major frontend files, including styling, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base setup with extensive OKLCH theme variables and global styles for light/dark mode.",
  "frontend/index.html": "HTML entry point loading Leaflet assets and bootstrapping the React application.",
  "frontend/src/App.tsx": "App wrapper applying theme support and rendering the EarthquakeDashboard.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Summary cards displaying total events, significant events, and largest quake details.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Modal dialog showing detailed earthquake metadata with high z-index overlay for proper stacking above Leaflet.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet-based map component rendering earthquake markers with popups, click handling, and z-index-safe container.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "Displays a table of earthquake events with magnitude badges, location, time, depth, and external links, supporting row selection.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "Provides UI controls for time window selection, magnitude filtering, text search, and data refresh actions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, including login, logout, and identity persistence via an auth client.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that USGS data fetching is handled elsewhere.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "Fetches USGS earthquake feed data using react-query with periodic refresh and time‑window‑based caching.",
  "frontend/src/index.css": "Defines Tailwind-based global styles, light/dark themes, and Leaflet z-index rules for map layering.",
  "frontend/src/lib/earthquakeFilters.ts": "Provides functions to filter earthquake features by magnitude and location and apply combined filters.",
  "frontend/src/lib/earthquakeStats.ts": "Computes basic stats from earthquake data, including totals, threshold counts, and max magnitude event.",
  "frontend/src/lib/fetchJson.ts": "Fetches a URL and returns parsed JSON, throwing an error on non‑OK responses.",
  "frontend/src/lib/formatters.ts": "Formats timestamps, magnitudes, depths, and coordinates into user‑friendly strings.",
  "frontend/src/lib/leafletTypes.ts": "Defines TypeScript types for Leaflet usage, checks for Leaflet availability, and creates magnitude‑styled map markers.",
  "frontend/src/lib/usgsFeeds.ts": "Provides USGS feed URL generation, time‑window options, and helper functions for magnitude labels and color mapping.",
  "frontend/src/lib/usgsTypes.ts": "Defines TypeScript interfaces for USGS earthquake GeoJSON data, filter types, and time window options.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Implements the main earthquake dashboard with filtering, data fetching, view modes, stats, and detail dialogs.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and content scanning for the project.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, and known issues for the earthquake app."
}