{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing responsive layout and table improvements with associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files including styles, configuration, utilities, hooks, and UI components.",
  "frontend/index.css": "Tailwind base styles with light/dark OKLCH theme variables and global background/foreground definitions.",
  "frontend/index.html": "HTML entry point loading Leaflet assets, setting metadata, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root app component providing theme support and rendering the EarthquakeDashboard page.",
  "frontend/src/components/earthquake/DashboardSummary.tsx": "Displays three summary cards showing total events, above-threshold count, and largest magnitude quake using stats props.",
  "frontend/src/components/earthquake/EarthquakeDetailsDialog.tsx": "Modal dialog showing detailed earthquake info with optional moment tensor data and dynamic fetching of event details.",
  "frontend/src/components/earthquake/EarthquakeMapView.tsx": "Leaflet map component rendering earthquake markers filtered by map bounds with debounced updates and click callbacks.",
  "frontend/src/components/earthquake/EarthquakeResultsTable.tsx": "Renders a virtualized table of earthquake events with selectable rows, magnitudes, and metadata. Uses a custom virtualization hook for performance on large datasets.",
  "frontend/src/components/earthquake/FeedAndFilterControls.tsx": "Provides UI controls for selecting time window, minimum magnitude, search query, and refreshing earthquake data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state and providing login and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating USGS data fetching occurs elsewhere.",
  "frontend/src/hooks/useUsgsEarthquakes.ts": "Fetches USGS earthquake feed data using React Query with periodic refresh and caching.",
  "frontend/src/hooks/useUsgsEventDetail.ts": "Fetches and caches detailed USGS event data for a specific earthquake when enabled.",
  "frontend/src/hooks/useVirtualWindow.ts": "Implements a lightweight virtualization system computing visible item ranges based on scroll position.",
  "frontend/src/index.css": "Defines Tailwind base styles, themed color variables, dark mode settings, custom gradients, animations, and Leaflet z-index adjustments.",
  "frontend/src/lib/earthquakeFilters.ts": "Provides filtering and sorting utilities for earthquakes by time window, magnitude, and location.",
  "frontend/src/lib/earthquakeMapBounds.ts": "Filters earthquakes to those within (or slightly outside) given map bounds with date-line handling.",
  "frontend/src/lib/earthquakeStats.ts": "Computes total earthquakes, those above a threshold, and finds the largest‑magnitude feature.",
  "frontend/src/lib/fetchJson.ts": "Fetches a URL and returns parsed JSON, throwing on HTTP errors.",
  "frontend/src/lib/formatters.ts": "Provides formatting helpers for timestamps, magnitude, depth, and coordinates.",
  "frontend/src/lib/leafletTypes.ts": "Defines Leaflet-related TypeScript types and utilities, including dynamic marker creation based on magnitude.",
  "frontend/src/lib/mmi.ts": "Maps MMI values to Roman numerals and labels and provides formatters for intensity.",
  "frontend/src/lib/usgsEventDetailTypes.ts": "Defines types for USGS event detail responses, including moment tensor product structures.",
  "frontend/src/lib/usgsFeeds.ts": "Builds USGS feed URLs and provides magnitude labels and color helpers.",
  "frontend/src/lib/usgsTypes.ts": "Declares core USGS GeoJSON feature and response types plus client-side filter types.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/EarthquakeDashboard.tsx": "Main dashboard component handling feed selection, filtering, stats, and table/map views.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme, colors, typography, animations, and container settings.",
  "project_state.json": "Project metadata including requirements, known issues, and architectural notes."
}