{
  "kind": "build_request",
  "title": "Fix Leaflet map turning black in fullscreen",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Leaflet map so that when the user enters fullscreen mode, the base map tiles remain visible (the map must not render as a black background) and the map correctly resizes to the fullscreen viewport.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the leaflet map when full screen become black"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the custom fullscreen control in the map enters fullscreen and OpenStreetMap tiles remain visible (no black map background).",
        "Exiting fullscreen restores the original constrained map height and tiles remain visible.",
        "Map controls (zoom buttons and fullscreen toggle) remain usable in fullscreen and non-fullscreen modes.",
        "Markers and popups still work as before in fullscreen and non-fullscreen modes.",
        "No console errors are introduced when toggling fullscreen multiple times."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the map fullscreen implementation to ensure Leaflet receives a correct container size after fullscreen changes by triggering a resize/invalidate after the fullscreen layout is applied (e.g., after React state-driven class/style updates) and ensuring the map container has a real fullscreen height/width while in fullscreen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the leaflet map when full screen become black"
        ]
      },
      "acceptanceCriteria": [
        "After toggling fullscreen, the Leaflet instance is invalidated/resized after the fullscreen layout is applied (not only immediately on the fullscreenchange event).",
        "In fullscreen, the map container dimensions match the viewport (100vw x 100vh or equivalent), and in non-fullscreen the map container matches the configured height.",
        "The fix is implemented within the existing Leaflet map component and global CSS (no new backend changes)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Adjust/extend the existing fullscreen-related CSS so the Leaflet container and its panes reliably render in fullscreen (including correct stacking context) without hiding the tile layer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the leaflet map when full screen become black"
        ]
      },
      "acceptanceCriteria": [
        "CSS changes do not cause the tile layer to be covered/hidden in fullscreen.",
        "Fullscreen styles do not break the layout of the rest of the dashboard when exiting fullscreen.",
        "The map remains interactive (panning/zooming) in fullscreen and non-fullscreen modes."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn) read-only path; compose components instead.",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain single-actor; no backend changes are required for this issue."
  ],
  "nonGoals": [
    "Adding new map providers or changing from OpenStreetMap tiles.",
    "Adding new fullscreen UI beyond fixing the existing fullscreen toggle behavior.",
    "Implementing backend persistence or logging for map state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}