{
  "kind": "build_request",
  "title": "Ensure Past Week/Past Month views show only events within the selected window and are sorted correctly",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "When the user selects the USGS time window \"Past Week\" or \"Past Month\", ensure the displayed earthquake list (table, map, stats, and details selection) is restricted to only events whose properties.time falls within the selected window (week = last 7 days; month = last 30 days), so results are not effectively treated as starting from smaller windows (hour/day) or containing older-than-window items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you sort the past week & months data only that week & months not start from past hour day week or months"
        ]
      },
      "acceptanceCriteria": [
        "With Time Window = Past Week, every displayed earthquake has (now - properties.time) <= 7 days.",
        "With Time Window = Past Month, every displayed earthquake has (now - properties.time) <= 30 days.",
        "The restriction applies consistently in all view modes (Table / Map / Split) and the summary cards reflect the same restricted set."
      ]
    },
    {
      "id": "REQ-25",
      "text": "For all time windows (Past Hour/Day/Week/Month), sort the displayed earthquake results by event time descending (most recent first) after applying the time-window restriction and other filters, so Past Week/Past Month lists do not appear to \"start\" with smaller-window ordering artifacts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "can you sort the past week & months data only that week & months not start from past hour day week or months"
        ]
      },
      "acceptanceCriteria": [
        "In the results table, the first row is the most recent event and times are non-increasing as you scroll down.",
        "Map rendering uses the same sorted+filtered dataset (even if markers are further reduced by visible map bounds optimization)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only shadcn/ui components).",
    "Keep the backend as-is (single Motoko actor; no backend changes required for this request)."
  ],
  "nonGoals": [
    "Adding new time windows beyond Past Hour/Day/Week/Month.",
    "Changing the USGS feed endpoints used (keep using https://earthquake.usgs.gov/earthquakes/feed/v1.0/summary/all_{timeWindow}.geojson).",
    "Adding new UI controls for sorting (this request is about correct default behavior)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}