{
  "kind": "build_request",
  "title": "Add subtitle text under hero title on dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-31",
      "text": "On the dashboard hero section (frontend/src/pages/EarthquakeDashboard.tsx), add a new subtitle line directly below the existing centered hero title \"Real - Time Earthquake Detection Around The World\". The subtitle must be rendered as an H2 and must read exactly: \"Latest real-time earthquake information around the world\". Keep the subtitle centered and visually secondary to the main hero title (smaller size and/or muted color), without changing the existing hero title wording, alignment, or layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "now add h2 text below the title text : Latest real-time earthquake information around the world"
        ]
      },
      "acceptanceCriteria": [
        "The hero section shows the existing title text unchanged: \"Real - Time Earthquake Detection Around The World\".",
        "A second line appears immediately below the title and is rendered as an H2 with exact text: \"Latest real-time earthquake information around the world\".",
        "The new subtitle is center-aligned and clearly styled as secondary (e.g., smaller font size and/or muted foreground) across breakpoints.",
        "No other dashboard sections (controls, summary, table/map/split views, footer) change behavior or content."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (read-only shadcn/ui sources).",
    "Keep the existing hero title text and its centered layout unchanged; only add the requested subtitle beneath it."
  ],
  "nonGoals": [
    "Do not change USGS data fetching, filtering, sorting, map behavior, or table rendering.",
    "Do not change global theming, branding, document title, or favicon assets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}