{
  "kind": "build_request",
  "title": "Remove hero banner, keep title text only, and add full-screen map control",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the current Hero/Banner section on the Earthquake Dashboard (background image/gradient, badge, and description text) and keep only the hero title text as a simple heading in the main content area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "remove the banner but keep the text title only"
        ]
      },
      "acceptanceCriteria": [
        "On the dashboard page, the previous hero/banner background and its decorative elements are no longer visible (no background image, no gradient overlay, no 'Live Monitoring' pill, no descriptive paragraph).",
        "The text title \"Global Earthquake Activity\" remains visible as a plain heading above the filters/controls.",
        "No backend changes are introduced."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a Leaflet full-screen toggle button to the map UI, positioned directly below the existing zoom in/out controls. The button must toggle the map container into a full-screen overlay and allow exiting full-screen to return to the prior layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add below the zoom in zoom out button of full screen map button"
        ]
      },
      "acceptanceCriteria": [
        "A new control button appears in the map controls stack directly below the Leaflet zoom controls (same corner/cluster).",
        "Clicking the button expands the map to full-screen (covering the viewport above other content) and clicking again exits full-screen, restoring the previous size and layout.",
        "The button includes accessible text (e.g., via aria-label and/or sr-only) in English such as \"Toggle full screen\".",
        "The full-screen behavior works in both Map View and Split View without breaking marker rendering or map interactions.",
        "Exiting full-screen restores normal page scrolling/interaction."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Changing earthquake data fetching, filtering, or marker rendering behavior.",
    "Adding new authentication or backend persistence features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}