{
  "kind": "build_request",
  "title": "Fix Refresh Data button not triggering an immediate USGS refetch",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make the \"Refresh Data\" button reliably trigger an immediate refetch of the currently selected USGS earthquake feed, even when the React Query cache is still fresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "fix the refresh data button not responding"
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Refresh Data\" triggers a new network request for the current time window feed (same query key used by the dashboard).",
        "The refresh action works repeatedly (e.g., multiple clicks separated by completion) and updates UI state based on the newest response.",
        "If the user changes the time window and then clicks refresh, the refetch targets the newly selected time window feed."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the refresh button loading/disabled behavior so it is not stuck in a disabled state due to background fetching; only disable (and show the spinner/\"Refreshing...\") while a user-initiated refresh is in progress.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "fix the refresh data button not responding"
        ]
      },
      "acceptanceCriteria": [
        "The \"Refresh Data\" button is clickable during normal idle state after data has loaded.",
        "Background auto-refetching (interval or window focus) does not permanently disable the button.",
        "While a manual refresh is in progress, the button shows \"Refreshing...\" with the spinning icon and is temporarily disabled to prevent duplicate manual refreshes."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a small, user-facing confirmation signal that a manual refresh occurred (e.g., \"Last refreshed: <time>\" near the controls), using English UI text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "fix the refresh data button not responding"
        ]
      },
      "acceptanceCriteria": [
        "After a successful manual refresh, a timestamp/confirmation is visible and updates to the latest refresh time.",
        "The confirmation UI does not appear to update when only background refetching occurs (unless the manual refresh also ran)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only components must be composed, not edited).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this fix."
  ],
  "nonGoals": [
    "Changing the USGS feed URLs or the filtering/sorting logic.",
    "Adding real-time websocket updates or any external backend/database integration.",
    "Redesigning the overall dashboard layout beyond what is necessary to show refresh feedback."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}