{
  "kind": "build_request",
  "title": "Fix bottom border clipping on split-view cards",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the UI so the bottom border of the Map and Table “border box” cards is fully visible and not clipped/misaligned in Split view (and remains correct in Map-only and Table-only views), matching the expected rounded card border shown in the screenshot.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the butttom of the boarder box"
        ]
      },
      "acceptanceCriteria": [
        "In Split view, neither the Map card nor the Table card has its bottom border (or rounded corners) clipped/cut off.",
        "The fix works at common breakpoints (mobile, tablet, desktop) without introducing new overflow/scrollbar artifacts.",
        "Map-only view still shows a correct, continuous border around the Map card (including the bottom edge).",
        "Table-only view still shows a correct, continuous border around the Table card and its inner bordered container."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Split view layout container styling to avoid clipping card borders (e.g., remove or adjust any parent `overflow-hidden` / fixed-height wrappers that cut off the Card’s bottom border) while keeping the intended 600px panel height behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the butttom of the boarder box"
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/pages/EarthquakeDashboard.tsx`, Split view no longer uses wrapper styles that visually cut off the Card border.",
        "Both panels remain the intended height (approximately 600px) and content remains usable (map visible, table scrollable)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this UI-only fix."
  ],
  "nonGoals": [
    "Adding new dashboard features or changing data fetching/filtering logic.",
    "Changing the overall theme/colors/typography beyond what is necessary to fix the border rendering issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}