{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make manual USGS feed refresh immediate, correctly disabled, and user-confirmed",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the Refresh Data button always forces an immediate refetch of the currently selected USGS feed, even when React Query data is still fresh.",
      "acceptanceCriteria": [
        "Clicking \"Refresh Data\" triggers a new network request for the current time window feed (same query key used by the dashboard).",
        "The refresh action works repeatedly (e.g., multiple clicks separated by completion) and updates UI state based on the newest response.",
        "If the user changes the time window and then clicks refresh, the refetch targets the newly selected time window feed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/EarthquakeDashboard.tsx",
          "operation": "modify",
          "description": "Replace the current invalidate-only refresh behavior with a true user-initiated force refetch for the active React Query key (['earthquakes', timeWindow]) by using the hook's refetch (or queryClient refetchQueries) so a network request is issued even when data is fresh; ensure the refresh uses the latest selected timeWindow and updates the dashboard from the returned data."
        },
        {
          "path": "frontend/src/hooks/useUsgsEarthquakes.ts",
          "operation": "modify",
          "description": "Confirm the queryKey is stable and consistent with the dashboard usage and, if needed, expose/enable a refetch behavior that can be invoked from the UI to force a network call regardless of staleTime (without changing feed URLs or filtering/sorting logic)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make the refresh button disabled/spinner state track only user-initiated refreshes (not background fetching) and avoid getting stuck disabled.",
      "acceptanceCriteria": [
        "The \"Refresh Data\" button is clickable during normal idle state after data has loaded.",
        "Background auto-refetching (interval or window focus) does not permanently disable the button.",
        "While a manual refresh is in progress, the button shows \"Refreshing...\" with the spinning icon and is temporarily disabled to prevent duplicate manual refreshes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/EarthquakeDashboard.tsx",
          "operation": "modify",
          "description": "Introduce explicit manual-refresh UI state (e.g., a local boolean) that is set only when the user clicks Refresh and cleared when that specific refetch completes/fails; keep background isFetching/isRefetching from React Query out of the button disabled logic so interval/window-focus refetches do not disable the button."
        },
        {
          "path": "frontend/src/components/earthquake/FeedAndFilterControls.tsx",
          "operation": "modify",
          "description": "Keep using shadcn/ui Button to present the refresh action, but wire its disabled state, label (\"Refreshing...\"), and spinning RefreshCw icon strictly to the manual-refresh flag passed from the dashboard (not general query fetching). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Show a user-facing confirmation that a manual refresh occurred by displaying an English 'Last refreshed' timestamp near the controls and update it only after manual refreshes.",
      "acceptanceCriteria": [
        "After a successful manual refresh, a timestamp/confirmation is visible and updates to the latest refresh time.",
        "The confirmation UI does not appear to update when only background refetching occurs (unless the manual refresh also ran)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/EarthquakeDashboard.tsx",
          "operation": "modify",
          "description": "Track a 'lastManualRefreshAt' timestamp in state and update it only on successful completion of the user-initiated refresh; pass this value down to the controls so it is not affected by background refetches."
        },
        {
          "path": "frontend/src/components/earthquake/FeedAndFilterControls.tsx",
          "operation": "modify",
          "description": "Render a small English confirmation line near the refresh controls (e.g., \"Last refreshed: <time>\") when lastManualRefreshAt is present, using existing app styling and shadcn/ui typography primitives as needed (compose only; do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}