{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Simplify dashboard header and add Leaflet full-screen map toggle",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the dashboard hero/banner visuals and keep only the \"Global Earthquake Activity\" title as a plain heading above the filters.",
      "acceptanceCriteria": [
        "On the dashboard page, the previous hero/banner background and its decorative elements are no longer visible (no background image, no gradient overlay, no 'Live Monitoring' pill, no descriptive paragraph).",
        "The text title \"Global Earthquake Activity\" remains visible as a plain heading above the filters/controls.",
        "No backend changes are introduced."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/EarthquakeDashboard.tsx",
          "operation": "modify",
          "description": "Remove the existing Hero Section markup (background image/gradient, badge, and description), and render \"Global Earthquake Activity\" as a simple heading within the main content area directly above the existing FeedAndFilterControls."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a custom Leaflet control that toggles the map into and out of a full-screen overlay, placed directly below the default zoom controls.",
      "acceptanceCriteria": [
        "A new control button appears in the map controls stack directly below the Leaflet zoom controls (same corner/cluster).",
        "Clicking the button expands the map to full-screen (covering the viewport above other content) and clicking again exits full-screen, restoring the previous size and layout.",
        "The button includes accessible text (e.g., via aria-label and/or sr-only) in English such as \"Toggle full screen\".",
        "The full-screen behavior works in both Map View and Split View without breaking marker rendering or map interactions.",
        "Exiting full-screen restores normal page scrolling/interaction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/earthquake/EarthquakeMapView.tsx",
          "operation": "modify",
          "description": "Implement a Leaflet custom control (positioned in the same corner as zoom controls) that is added after map creation so it renders directly below the zoom control, toggles a full-screen overlay mode for the map container, includes accessible text via aria-label, calls map.invalidateSize() when toggling to preserve rendering, and disables/enables page scrolling appropriately while in full-screen for both Map View and Split View."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS classes used by EarthquakeMapView full-screen mode (e.g., fixed positioning to cover the viewport, high z-index above page content, and height/width overrides to ignore inline size constraints), plus any minimal styling for the custom Leaflet control to visually match the existing control stack."
        }
      ]
    }
  ]
}