{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Leaflet fullscreen rendering and resize for Earthquake map",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the Leaflet map keeps base tiles visible and resizes correctly when entering/exiting fullscreen via the custom control.",
      "acceptanceCriteria": [
        "Clicking the custom fullscreen control in the map enters fullscreen and OpenStreetMap tiles remain visible (no black map background).",
        "Exiting fullscreen restores the original constrained map height and tiles remain visible.",
        "Map controls (zoom buttons and fullscreen toggle) remain usable in fullscreen and non-fullscreen modes.",
        "Markers and popups still work as before in fullscreen and non-fullscreen modes.",
        "No console errors are introduced when toggling fullscreen multiple times."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/earthquake/EarthquakeMapView.tsx",
          "operation": "modify",
          "description": "Stabilize fullscreen toggle behavior so tiles never render black: keep the existing custom fullscreen control, but ensure the Leaflet instance is revalidated after fullscreen transitions and after React class updates; also ensure marker/popup interactions and control click handling remain unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update fullscreen-related Leaflet/map styles to prevent the tile layer from being visually hidden/covered (e.g., stacking/background issues) and to keep controls usable in fullscreen and normal modes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Trigger Leaflet resize/invalidate after fullscreen layout is applied and ensure true fullscreen container dimensions.",
      "acceptanceCriteria": [
        "After toggling fullscreen, the Leaflet instance is invalidated/resized after the fullscreen layout is applied (not only immediately on the fullscreenchange event).",
        "In fullscreen, the map container dimensions match the viewport (100vw x 100vh or equivalent), and in non-fullscreen the map container matches the configured height.",
        "The fix is implemented within the existing Leaflet map component and global CSS (no new backend changes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/earthquake/EarthquakeMapView.tsx",
          "operation": "modify",
          "description": "Refactor fullscreen resize logic to run after layout settles: move invalidateSize calls to a React effect driven by the fullscreen state and/or attach a ResizeObserver on the map container to call invalidateSize on size changes (including fullscreen enter/exit), scheduling the call(s) via requestAnimationFrame/timeout to occur after DOM updates."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure the fullscreen class/pseudo-state results in real viewport-sized dimensions for the Leaflet container (and that non-fullscreen continues to respect the configured constrained height), without relying on backend changes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Adjust fullscreen CSS so Leaflet container and panes render reliably in fullscreen with correct stacking context and visible tiles.",
      "acceptanceCriteria": [
        "CSS changes do not cause the tile layer to be covered/hidden in fullscreen.",
        "Fullscreen styles do not break the layout of the rest of the dashboard when exiting fullscreen.",
        "The map remains interactive (panning/zooming) in fullscreen and non-fullscreen modes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Harden Leaflet fullscreen CSS: ensure the fullscreen container establishes a reliable stacking context, the tile pane remains visible (avoid global pane z-index settings that can hide tiles), and apply appropriate background/positioning rules for .leaflet-container:fullscreen and the .map-fullscreen state so tiles render and interaction remains intact."
        },
        {
          "path": "frontend/src/components/earthquake/EarthquakeMapView.tsx",
          "operation": "modify",
          "description": "Align component class/state usage with the updated fullscreen CSS (e.g., ensure the fullscreen class is applied to the actual Leaflet container element and that any transitions do not interfere with Leaflet rendering), keeping existing map behavior and UI structure intact."
        }
      ]
    }
  ]
}