{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Earthquake results table cropping in Table and Split views",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Adjust EarthquakeResultsTable and Split view container sizing so the scrollable table content is not clipped and the last row remains fully visible while preserving the sticky header and virtualization.",
      "acceptanceCriteria": [
        "In Table view, scrolling to the end of the list shows the last row fully (no bottom clipping/cropping).",
        "In Split view, the EarthquakeResultsTable is not clipped by its parent container; the table area is scrollable and the last row is fully visible.",
        "The table header remains usable/visible (no regressions to the existing sticky header behavior).",
        "No changes are made to read-only shadcn/ui component source files under `frontend/src/components/ui`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/earthquake/EarthquakeResultsTable.tsx",
          "operation": "modify",
          "description": "Refactor the results table layout to support both a fixed-height (Table view) and a parent-constrained (Split view) mode without changing virtualization: make the Card and CardContent capable of `h-full` + `flex` + `min-h-0`, move the scroll container to use `flex-1 min-h-0 overflow-auto` (instead of a hardcoded 600px maxHeight when in fill mode), and ensure there is no bottom clipping at the end of scroll (e.g., by ensuring the scroll container owns the height and has appropriate inner padding/space for the last row). Preserve existing sticky header behavior within the scrolling container."
        },
        {
          "path": "frontend/src/pages/EarthquakeDashboard.tsx",
          "operation": "modify",
          "description": "Update Split view wrappers so the table can fully use the available 600px height without being clipped by an `overflow-hidden` parent: change the table-side wrapper to a flex column container with `h-[600px] min-h-0` and avoid overflow rules that clip the Card; pass a prop/config to EarthquakeResultsTable to use parent-fill sizing in Split view while keeping the existing 600px-scrolling behavior in Table view."
        }
      ]
    }
  ]
}