{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix USGS Past Week/Month time-window restriction and ensure consistent most-recent-first sorting",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Apply an explicit client-side time-window cutoff for Past Week (7d) and Past Month (30d) so all views/stats/details only use events within the selected window.",
      "acceptanceCriteria": [
        "With Time Window = Past Week, every displayed earthquake has (now - properties.time) <= 7 days.",
        "With Time Window = Past Month, every displayed earthquake has (now - properties.time) <= 30 days.",
        "The restriction applies consistently in all view modes (Table / Map / Split) and the summary cards reflect the same restricted set."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/earthquakeFilters.ts",
          "operation": "modify",
          "description": "Extend filtering utilities to support time-window restriction based on feature.properties.time (hour/day/week/month => last 1h/24h/7d/30d). Ensure the restriction is applied before other filters and is reusable from the dashboard."
        },
        {
          "path": "frontend/src/pages/EarthquakeDashboard.tsx",
          "operation": "modify",
          "description": "Update the dashboard’s filtered dataset derivation to include the selected timeWindow in the filtering pipeline so the table/map/split views, summary stats, and details selection all operate on the same time-window-restricted set."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Sort earthquakes by event time descending (most recent first) after applying time-window restriction and other filters, and pass this same sorted dataset to table and map.",
      "acceptanceCriteria": [
        "In the results table, the first row is the most recent event and times are non-increasing as you scroll down.",
        "Map rendering uses the same sorted+filtered dataset (even if markers are further reduced by visible map bounds optimization)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/earthquakeFilters.ts",
          "operation": "modify",
          "description": "Add a shared sorting step (or utility) that orders the filtered features by properties.time descending, applied after time-window restriction and other filters."
        },
        {
          "path": "frontend/src/pages/EarthquakeDashboard.tsx",
          "operation": "modify",
          "description": "Ensure the dataset passed into DashboardSummary, EarthquakeResultsTable, and EarthquakeMapView is the same filtered+time-window-restricted+time-desc-sorted array for all time windows (hour/day/week/month)."
        }
      ]
    }
  ]
}